{
  "experience": [
    {
      "company": "PT Wolkk Cloud Development",
      "position": "QA Engineer, Business Analyst, and Product Owner",
      "duration": "2022 - Present",
      "location": "Remote, Germany -> Indonesia",
      "description": "led cross-country POS rollouts across Europe—aligning legal, business, and tech requirements—while driving Agile delivery, QA excellence, and stakeholder collaboration to ensure smooth market launches",
      "achievements": [
        "Led EU POS rollouts, aligned legal needs, managed resources, synced stakeholders, and bridged global goals with local market priorities.",
        "Implemented CI/CD testing pipeline reducing deployment time by 50%",
        "Led EU POS rollouts in Italy, Lithuania, and Hungary while bridging legal, tech, and business needs while ensuring compliance, clarity, and smooth delivery.",
        "Led POS testing, created documentation, ensured compliance and performance, and resolved bugs with Dev teams to deliver smooth, reliable rollouts."
      ],
      "technologies": ["Selenium", "TestNG", "Jenkins", "Docker", "JIRA", "Confluence", "Postman", "Git", "Agile", "Scrum", "Kanban"]
    },
    {
      "company": "InnovateTech",
      "position": "QA Engineer",
      "duration": "2018 - 2020",
      "location": "Seattle, WA",
      "description": "Developed automated testing frameworks and executed comprehensive testing strategies for web and mobile applications.",
      "achievements": [
        "Built automated testing framework reducing manual testing by 60%",
        "Improved test coverage from 40% to 85% across all applications",
        "Implemented API testing strategy for microservices architecture",
        "Collaborated with development teams to establish testing standards"
      ],
      "technologies": ["Cypress", "Appium", "Python", "Postman", "TestRail", "Git"]
    },
    {
      "company": "StartupXYZ",
      "position": "Junior QA Engineer",
      "duration": "2016 - 2018",
      "location": "Austin, TX",
      "description": "Performed manual and automated testing for early-stage startup products, contributing to quality assurance processes.",
      "achievements": [
        "Established initial QA processes and documentation",
        "Performed comprehensive testing for 5 product releases",
        "Identified and documented 500+ bugs across various platforms",
        "Contributed to improving overall product quality by 40%"
      ],
      "technologies": ["Selenium", "Manual Testing", "Bug Tracking", "Test Documentation"]
    }
  ]
}